Tekla Open API Reference for Tekla Structures 2025
AnalysisModelAnalysisProperties.AnalysisMethodEnum Enumeration
 Defines the analysis method.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum AnalysisMethodEnum
Public Enumeration AnalysisMethodEnum
Members
Member name | Value | Description
FIRST_ORDER | 1 |  The first order calculation method.
P_DELTA | 2 |  The P-delta calculation method.
NON_LINEAR | 3 |  The non-linear calculation method.
See Also
Reference
Tekla.Structures.Analysis Namespace